In [1]:
import mysql.connector as sqlconnect

#### Creating connection

In [3]:
def create_connection(passwd, dbname = None):
    connect = sqlconnect.connect(\
                                host = 'localhost',
                                user = "root",
                                passwd = passwd,
                                database = dbname)
    
    try:
        cursor = connect.cursor()
        query = "select @@version"
        cursor.execute(query)
        out = cursor.fetchall()
        print('Database version: ', out)
    except Exception as e:
        print("Exception error: ", e)
        
    #connect.close()
    
    return connect
create_connection(passwd)

Database version:  [('8.0.23',)]

#### Creating database

In [5]:
def create_db(connect, dbname):
    cursor = connect.cursor()
    query = "CREATE DATABASE IF NOT EXISTS " + dbname
    cursor.execute(query)
    print("Database created successfully!\n")
    cursor.execute('SHOW DATABASES')
    
    return [db for db in cursor]

In [6]:
connect = create_connection(passwd)

create_db(connect, 'iqube_lwu')

#dblist

Database version:  [('8.0.23',)]
Database created successfully!

[('firstdb',),
 ('information_schema',),
 ('iqube_learn',),
 ('iqube_learn2',),
 ('iqube_learn3',),
 ('iqube_lwu',),
 ('mysql',),
 ('performance_schema',),
 ('sys',)]

#### Creating data tables

In [7]:
def run_query(connect, query):
    try:
        cursor = connect.cursor()
        cursor.execute(query)
        print('Query executed successfully.')
        cursor.execute("SHOW TABLES")
        for tb in cursor:
            print(tb)
    except Exception as e:
        print('Exception error: ', e)

In [29]:
query = """
    CREATE TABLE IF NOT EXISTS students(
        name VARCHAR(255),
        age INT
        )
    """

connect = create_connection(passwd, "iqube_lwu")
run_query(connect, query)
#new = run_query(connect, "SHOW TABLES")

Database version:  [('8.0.23',)]
Query executed successfully.

[]

#### Populating and Updating data into table

In [24]:
def run_query(connect, query):
    try:
        cursor = connect.cursor()
        cursor.execute(query)
        connect.commit() # To save changes
        print('Query executed successfully.')
    except Exception as e:
        print('Exception error: ', e)

In [43]:
query = """
    INSERT INTO 
        students (name, age)
    VALUES
        ('Rachel', 12),
        ('Amanda', 32),
        ('Jacob', 21),
        ('Avi', 28),
        ('Michelle', 17)"""

run_query(connect, query)

Query executed successfully.

In [25]:
update = """
    UPDATE students
    SET
        age = 13
    WHERE 
        name = 'Jacob'"""

run_query(connect, update)

Query executed successfully.

#### Selecting and Getting data and Limiting output

In [43]:
def run_query(connect, query):
    result = None
    try:
        cursor = connect.cursor()
        cursor.execute(query)
        result =  cursor.fetchall()
        print('Query executed successfully.\n')
        connect.commit()
        return result
    except Exception as e:
        print('Exception error: ', e)

In [44]:
query = "SELECT * FROM students"

out = run_query(connect, query)

for row in out:
    print(row)

Query executed successfully.

('Amanda', 32)
('Jacob', 13)
('Avi', 28)
('Michelle', 17)

In [30]:
query = "SELECT * FROM students LIMIT 3"

limit = run_query(connect, query)

for row in limit:
    print(row)

Query executed successfully.

('Rachel', 22)
('Rachel', 12)
('Amanda', 32)

In [31]:
query = "SELECT * FROM students LIMIT 3 OFFSET 2"

out = run_query(connect, query)

for row in out:
    print(row)

Query executed successfully.

('Amanda', 32)
('Jacob', 13)
('Avi', 28)

#### Query condition with WHERE and Wildcards

In [16]:
query = """
    SELECT * FROM students
    WHERE
        age > 25"""

run_query(connect, query)

Query executed successfully.

[('Amanda', 32), ('Avi', 28)]

In [17]:
query = """
    SELECT * FROM students
    WHERE
        name LIKE 'Ra%'"""

run_query(connect, query)

Query executed successfully.

[('Rachel', 22), ('Rachel', 12)]

In [18]:
query = """
    SELECT * FROM students
    WHERE
        name LIKE '%ac%'"""

run_query(connect, query)

Query executed successfully.

[('Rachel', 22), ('Rachel', 12), ('Jacob', 21)]

In [23]:
# Using placeholders for running mysql queries
query = """
    SELECT * FROM students
    WHERE
        name = %s"""

run_query(connect, (query, 'Rachel', ))

Exception error:  'tuple' object has no attribute 'encode'

In [35]:
order = """
    SELECT * FROM students ORDER BY age DESC"""

result = run_query(connect, order)
for r in result:
    print(r)

Query executed successfully.

('Amanda', 32)
('Avi', 28)
('Rachel', 22)
('Michelle', 17)
('Jacob', 13)
('Rachel', 12)

In [36]:
order = """
    SELECT * FROM students ORDER BY name DESC"""

result = run_query(connect, order)
for r in result:
    print(r)

Query executed successfully.

('Rachel', 22)
('Rachel', 12)
('Michelle', 17)
('Jacob', 13)
('Avi', 28)
('Amanda', 32)

#### MySql to pandas DataFrame

In [12]:
query = "SHOW COLUMNS FROM students"

out2 = run_query(connect, query)

out2

Query executed successfully.

[('name', b'varchar(255)', 'YES', '', None, ''),
 ('age', b'int', 'YES', '', None, '')]

In [14]:
import pandas as pd
columns = [tupl[0] for tupl in out2]
newt = pd.DataFrame(out, columns = columns)
newt

       name  age
0    Rachel   22
1    Rachel   12
2    Amanda   32
3     Jacob   21
4       Avi   28
5  Michelle   17

### Deleting Entries and dropping queries

In [38]:
delete = """DELETE FROM students
    WHERE
        name = 'Rachel'"""
run_query(connect, delete)

Query executed successfully.

In [46]:
# Deleting tables

delete = """DROP TABLE IF EXISTS students"""
run_query(connect, delete)

Query executed successfully.

[]

In [53]:
# Deleting databases

delete = """DROP DATABASE IF EXISTS iqube_learn"""
run_query(connect, delete)

Query executed successfully.

[]

In [54]:
# Deleting databases

showdb = """SHOW DATABASES"""
check = run_query(connect, showdb)
check

Query executed successfully.

[('firstdb',),
 ('information_schema',),
 ('iqube_lwu',),
 ('mysql',),
 ('performance_schema',),
 ('sys',)]